app/controllers/participants_controller.rb

INSERT INTO "participants" ("name", "updated_at", "description", "pattern_system_id", "created_at") VALUES('Bob', '2009-04-15 11:15:25', '', NULL, '2009-04-15 11:15:25')
UPDATE "participants" SET "pattern_system_id" = 266847009, "updated_at" = '2009-04-15 11:15:25' WHERE "id" = 795762451
---
  def create
    # @pattern_system = PatternSystem.find(params[:pattern_system_id])
    @participant = Participant.new(params[:participant])
    respond_to do |format|
      if @participant.save
        @pattern_system.participants << @participant
        @pattern_system.save

SELECT * FROM "participants" WHERE ("participants"."id" = 795762445)
---
  def edit
    # @pattern_system = PatternSystem.find(params[:pattern_system_id])
    flash[:participant] = Participant.find(params[:id])

SELECT * FROM "participants" WHERE ("participants"."id" = 795762445)
UPDATE "participants" SET "name" = 'Participant 1', "updated_at" = '2009-04-15 14:29:10' WHERE "id" = 795762453
---
  def update
    # @pattern_system = PatternSystem.find(params[:pattern_system_id])
    @participant = Participant.find(params[:id])

    respond_to do |format|
      if @participant.update_attributes(params[:participant])

SELECT * FROM "participants" WHERE ("participants"."id" = 795762451)
DELETE FROM "participants" WHERE "id" = 795762451
---
  def destroy
    # @pattern_system = PatternSystem.find(params[:pattern_system_id])
    @participant = Participant.find(params[:id])
    @participant.destroy

SELECT "pattern_systems".id FROM "pattern_systems" WHERE ("pattern_systems"."short_name" = 'sys_test' AND "pattern_systems".id <> 266847009) LIMIT 1
---
  def load_system
    @pattern_system = PatternSystem.find_by_short_name(params[:pattern_system_id])