app/controllers/pattern_systems_controller.rb

  def show
    if flash[:participant]
      @participant=flash[:participant]
    end
    @isEditing = flash[:isEditing]
    @participants_list = @pattern_system.participants
    @patterns_list = ProcessPattern.find_all_by_pattern_system_id(@pattern_system)
    unless @pattern_system.root_pattern.blank?
      @root_pattern = ProcessPattern.find(@pattern_system.root_pattern)
---
SELECT * FROM "participants" WHERE ("participants".pattern_system_id = 266846998)
SELECT * FROM "process_patterns" WHERE ("process_patterns"."pattern_system_id" = '266846998')
SELECT * FROM "process_patterns" WHERE ("process_patterns"."id" = 136429198)

  def create
    @pattern_system = PatternSystem.new(params[:pattern_system])
    @noob_mode = cookies[:noob_mode] == 'true' ? true : false

    respond_to do |format|
      if @pattern_system.save
---
INSERT INTO "pattern_systems" ("name", "root_pattern_id", "participant_id", "updated_at", "author", "update_field", "characteristics", "version", "short_name", "created_at") VALUES('Système de test', '', NULL, '2009-04-12 16:15:26', 'Guillaume Godet-Bar', '', '', NULL, NULL, '2009-04-12 16:15:26')

  def update
    params[:pattern_system][:root_pattern] = params[:pattern_system][:root_pattern].blank? ? nil : ProcessPattern.find(params[:pattern_system][:root_pattern])
    respond_to do |format|
      if @pattern_system.update_attributes(params[:pattern_system])
---
SELECT * FROM "pattern_systems" WHERE ("pattern_systems"."id" = 266846998)
SELECT * FROM "process_patterns" WHERE ("process_patterns".pattern_system_id = 266847009)
UPDATE "pattern_systems" SET "root_pattern_id" = '136429233', "updated_at" = '2009-04-15 14:44:41' WHERE "id" = 266847009

  def destroy
    @pattern_system.destroy
---
DELETE FROM "pattern_systems" WHERE "id" = 266847008

  def load_system
      @pattern_system = PatternSystem.find_by_short_name(params[:id])
---
SELECT "pattern_systems".id FROM "pattern_systems" WHERE ("pattern_systems"."short_name" = '' AND "pattern_systems".id <> 266847009) LIMIT 1