app/controllers/pattern_systems_controller.rb

  def new_participant
    @pattern_system = PatternSystem.find(params[:id])
---
SELECT * FROM "pattern_systems" WHERE ("pattern_systems"."id" = 266846998)

  def show
    @pattern_system = PatternSystem.find(params[:id])
---
SELECT * FROM "pattern_systems" WHERE ("pattern_systems"."id" = 266846998)

  def edit
    @pattern_system = PatternSystem.find(params[:id])
---
SELECT * FROM "pattern_systems" WHERE ("pattern_systems"."id" = 266847006)

  def destroy
    @pattern_system = PatternSystem.find(params[:id])
---
SELECT * FROM "pattern_systems" WHERE ("pattern_systems"."id" = 266847006)