app/controllers/process_patterns_controller.rb

SELECT * FROM "mappable_images" WHERE ("mappable_images"."process_pattern_id" = '136429226') LIMIT 1
---
  def show
    @image = MappableImage.find_by_process_pattern_id(params[:id])

SELECT * FROM "pattern_systems" WHERE ("pattern_systems"."id" = 266847015)
---
  def load_system
      @pattern_system = PatternSystem.find(session[:pattern_system_id])