app/controllers/process_patterns_controller.rb

  def tmp_images
    @images = MappableImage.all.select{|image|
---
SELECT * FROM "mappable_images"

  def add_participant
    @participants = Participant.find(session[:participants])
---
SELECT * FROM "participants" WHERE ("participants".pattern_system_id = 266846998)

  def index
    if params[:search]
      puts @pattern_system.id
      @patterns = ProcessPattern.search(params[:search], :with => { :pattern_system_id => @pattern_system.id })
---
SELECT * FROM "process_patterns" WHERE ("process_patterns"."pattern_system_id" = '266846998')

  def edit
    session[:participants] = @process_pattern.participants.collect{|part| part.id}
---
SELECT "participants".* FROM "participants" INNER JOIN participations ON participants.id = participations.participant_id WHERE (("participations".process_pattern_id = 136429197))

  def create
    context_patterns = params[:process_pattern][:context_patterns]
    params[:process_pattern][:context_patterns] = []
    unless context_patterns.blank? || (context_patterns.size == 1 && context_patterns[0].include?(?[))
      context_patterns.each{ |pattern_id|
        params[:process_pattern][:context_patterns] << ProcessPattern.find(pattern_id) unless pattern_id.split.empty?
      }
    end

    use_patterns = params[:process_pattern][:use_patterns]
    params[:process_pattern][:use_patterns] = []
    unless use_patterns.blank? || (use_patterns.size == 1 && use_patterns[0].include?(?[))
      use_patterns.each{ |pattern_id|
        params[:process_pattern][:use_patterns] << ProcessPattern.find(pattern_id) unless pattern_id.split.empty?
      }
    end
    @process_pattern = ProcessPattern.new(params[:process_pattern])
    unless params[:mappable_image].blank?
      @mappable_image = MappableImage.new(params[:mappable_image])
      @mappable_image.pattern_system = @pattern_system
      @mappable_image.save
      @process_pattern.mappable_image = @mappable_image
    end

    if session[:participants].blank?
      @participants = []
    else
      @participants = Participant.find(session[:participants])
    end
    @selectable_participants = @pattern_system.participants - @participants
    @process_pattern.participants = @participants

---
INSERT INTO "context_patterns" ("target_pattern_id", "source_pattern_id") VALUES (136429203, 136429213)
INSERT INTO "mappable_images" ("content_type", "map_id", "updated_at", "size", "thumbnail", "process_pattern_id", "filename", "height", "width", "created_at") VALUES(NULL, NULL, '2009-04-09 11:04:52', NULL, NULL, 136429227, NULL, NULL, NULL, '2009-04-09 11:04:52')
INSERT INTO "process_patterns" ("name", "uses", "updated_at", "process_solution", "product_solution", "application_case", "application_consequence", "requires", "author", "processContext", "productContext", "classification", "alternative", "pattern_system_id", "forces", "problem", "process_model_uri", "created_at") VALUES('Description des modèles de tâches', NULL, '2009-03-22 11:41:23', '', '', '', '', NULL, 'Guillaume Godet-Bar', NULL, '', '<p>Activit&eacute;</p>', NULL, 266846998, '<ul>
SELECT * FROM "pattern_systems" WHERE ("pattern_systems"."id" = 266847006)
SELECT * FROM "participants" WHERE ("participants".pattern_system_id = 266847006)

  def update
    @process_pattern.participants = Participant.find(session[:participants])
    @participants = @process_pattern.participants
    @selectable_participants = @pattern_system.participants - @participants
    @mappable_image = @process_pattern.mappable_image
    unless session[:maps].blank?
      session[:maps].each {|map|
      @aMap = Map.new(map)
      @mappable_image.maps << @aMap
      }
      session[:maps] = nil
    end

    # TODO Utiliser les mécanismes d'injection!
    context_patterns = params[:process_pattern][:context_patterns]
    params[:process_pattern][:context_patterns] = []
    unless context_patterns.blank? || (context_patterns.size == 1 && context_patterns[0].include?(?[))
      context_patterns.each{ |pattern_id|
        params[:process_pattern][:context_patterns] << ProcessPattern.find(pattern_id) unless pattern_id.split.empty?
      }
    end

    use_patterns = params[:process_pattern][:use_patterns]
    params[:process_pattern][:use_patterns] = []
    unless use_patterns.blank? || (use_patterns.size == 1 && use_patterns[0].include?(?[))
      use_patterns.each{ |pattern_id|
        params[:process_pattern][:use_patterns] << ProcessPattern.find(pattern_id) unless pattern_id.split.empty?
      }
    end

    respond_to do |format|
      proceedUpdate = @process_pattern.update_attributes(params[:process_pattern])
      unless params[:mappable_image].blank? || params[:mappable_image][:uploaded_data].blank?
        if @mappable_image.blank?
          @mappable_image = MappableImage.new(params[:mappable_image])
          @mappable_image.pattern_system = @pattern_system
          proceedUpdate &= @mappable_image.save
---
SELECT * FROM "participants" INNER JOIN "participations" ON "participants".id = "participations".participant_id WHERE ("participations".process_pattern_id = 136429211 )
SELECT * FROM "maps" WHERE ("maps".mappable_image_id = 9)
INSERT INTO "mappable_images" ("content_type", "map_id", "updated_at", "size", "thumbnail", "process_pattern_id", "filename", "height", "width", "created_at") VALUES('image/png', NULL, '2009-03-22 09:53:52', 269715, NULL, NULL, 'PhaseEtudePrealable.png', 444, 800, '2009-03-22 09:53:52')
INSERT INTO "maps" ("updated_at", "pattern_id", "mappable_image_id", "height", "y_corner", "x_corner", "width", "created_at") VALUES('2009-03-21 17:46:15', 136429202, NULL, 76, 328, 252, 176, '2009-03-21 17:46:15')
INSERT INTO "use_patterns" ("updated_at", "id", "target_pattern_id", "source_pattern_id", "created_at") VALUES ('2009-03-22 11:41:23', 136429214, 136429214, 136429202, '2009-03-22 11:41:23')
INSERT INTO "context_patterns" ("target_pattern_id", "source_pattern_id") VALUES (136429202, 136429212)
SELECT * FROM "mappable_images" WHERE ("mappable_images".process_pattern_id = 136429211) LIMIT 1
SELECT * FROM "pattern_systems" WHERE ("pattern_systems"."id" = 266846998)
SELECT * FROM "process_patterns" INNER JOIN "context_patterns" ON "process_patterns".id = "context_patterns".target_pattern_id WHERE ("context_patterns".source_pattern_id = 136429211 )

  def destroy
    @process_pattern.destroy
---
DELETE FROM "process_patterns" WHERE "id" = 136429230

  def find_pattern
    @process_pattern = ProcessPattern.find(params[:id])
---
SELECT * FROM "process_patterns" WHERE ("process_patterns"."id" IN (136429202,136429209,136429210))

  def load_system
        @pattern_system = PatternSystem.find_by_short_name(params[:pattern_system_id])
        @patterns_list = ProcessPattern.find_all_by_pattern_system_id(@pattern_system.id, :order => :name)
---
SELECT * FROM "pattern_systems" WHERE ("pattern_systems"."short_name" = 'symphony_augmentee') LIMIT 1
SELECT "process_patterns".id FROM "process_patterns" WHERE ("process_patterns"."name" = 'Connexion des espaces métier et interactionnel' AND "process_patterns".pattern_system_id = 266846998 AND "process_patterns".id <> 136429211) LIMIT 1