app/controllers/process_patterns_controller.rb

  def tmp_images
    puts 'tmp_images called'
    @images = MappableImage.all.select{|image| image.process_pattern.pattern_system.short_name == @pattern_system.short_name}
---
SELECT * FROM "process_patterns" WHERE ("process_patterns"."name" = 'Bof') LIMIT 1